TODO.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title><b>TODO</b></title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="<b>TODO</b>"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-01-19T22:20+0000"/>
<meta name="author" content="nil"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title"><b>TODO</b></h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Documentation <code>Doc</code></a></li>
<li><a href="#sec-2">2 Source code <code>Src</code></a></li>
<li><a href="#sec-3">3 Release <code>GitHub</code></a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Documentation <code>Doc</code></h2>
<div class="outline-text-2" id="text-1">

<ul>
<li id="sec-1-1"><span class="done DONE">DONE</span> Complete the replacement of <code>\begin{lstlisting}</code> for <code>\lstinputlisting</code><br/>
     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2014-01-19 Sun 17:35</span></span><br/>
    such that all code listings are imported directly from the source files in
    <code>Src</code>.  See <code>chap.tex</code> for an example of what needs to be done.  Note that
    using the annotation syntax <code>/// &lt;lable name&gt;</code> the Makefile generates the
    list of first and last line numbers automatically.  See <code>Src/main.C</code> for an
    example.
</li>
</ul>
<ul>
<li id="sec-1-2"><span class="todo TODO">TODO</span> Rename files to correspond to the languages rather than the chapters<br/>
    Alternatively combine the language name and the chapter number <i>e.g.</i> "chap2_lisp.tex"

</li>
</ul>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Source code <code>Src</code></h2>
<div class="outline-text-2" id="text-2">

<ul>
<li id="sec-2-1"><span class="done DONE">DONE</span> Complete the conversion of member functions and arguments to <code>const</code><br/>
     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2014-01-19 Sun 17:36</span></span><br/>
    where appropriate.  Once this is done the <code>const_cast</code> statements can be
    removed.
</li>
</ul>
<ul>
<li id="sec-2-2"><span class="todo TODO">TODO</span> Introduce a <code>namespace</code><br/>
    <i>e.g.</i> <code>Kamin</code> or <code>Budd</code> or <code>BuddKamin</code>.
</li>
</ul>
<ul>
<li id="sec-2-3"><span class="todo TODO">TODO</span> Update <code>Makefile</code> adding proper dependency checking.<br/>
</li>
</ul>
<ul>
<li id="sec-2-4"><span class="done DONE">DONE</span> Rename files to correspond to the languages rather than the chapters.<br/>
     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2014-01-14 Tue 22:54</span></span><br/>
</li>
</ul>
<ul>
<li id="sec-2-5"><span class="todo TODO">TODO</span> Replace use of <code>char*</code> with C++ <code>std::string</code><br/>
</li>
</ul>
<ul>
<li id="sec-2-6"><span class="todo TODO">TODO</span> Replace C IO functions with C++ <code>std::iostream</code> operators.<br/>
</li>
</ul>
<ul>
<li id="sec-2-7"><span class="todo TODO">TODO</span> Complete updating Kamin test codes for the Budd versions of the intepreters<br/>
</li>
</ul>
<ul>
<li id="sec-2-8"><span class="todo TODO">TODO</span> Use valgrind to test for memory leaks<br/>

</li>
</ul>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Release <code>GitHub</code></h2>
<div class="outline-text-2" id="text-3">

<ul>
<li id="sec-3-1"><span class="todo TODO">TODO</span> When the code is updated release on GitHub<br/>
</li>
</ul>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-01-19T22:20+0000</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
